<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5a71021077dd3ae44c9aad3998f38273cc68c5c5372e1281b560b91fd6281dab","plan_job_ref":"Job Write Terraform Plan to Pull Request #60 at https://github.com/hackforla/devops-security/actions/runs/11265567492","plan_out_hash":"d8f7bb4ae749a002235e7238ba62005904ae9ceb553b7fc25ac28cb004db3f6b","plan_hash":"0a39e0025b2d162eae303b715f94b1521c7621656a800db37f0664d0aac9a41b","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_drakeredwind01.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "drakeredwind01"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_drakeredwind01.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "drakeredwind01"
    }

  # module.iam_user_drakeredwind01.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "drakeredwind01"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #60](https://github.com/hackforla/devops-security/actions/runs/11265567492)